/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parsing.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seomoon <seomoon@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/05 18:25:09 by seomoon           #+#    #+#             */
/*   Updated: 2021/06/05 18:38:21 by seomoon          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishell.h"


int		parse_input(t_cmd *cmd_head, char *input)
{
	/*
	1. input(입력된 커맨드라인)을 스페이스 기준으로 쪼개기
	2. 이 때, 따옴표 안의 스페이스는 문자열로 처리함
	3. 쪼갠 인자들을 2차원 배열(문자열 포인터 배열)에 저장하기
	*/
}

int		main()
{

}
